mazelb/Heddoko-Firmware/HeddokoBLE/HeddokoBLE.cydsn/Generated_Source/PSoC4/TIMER_1.c
/*******************************************************************************
* File Name: TIMER_1.c
* Version 2.10
*
* Description:
*  This file provides the source code to the API for the TIMER_1
*  component
*
* Note:
*  None
*
********************************************************************************
* Copyright 2013-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#include "TIMER_1.h"

uint8 TIMER_1_initVar = 0u;


/*******************************************************************************
* Function Name: TIMER_1_Init
********************************************************************************
*
* Summary:
*  Initialize/Restore default TIMER_1 configuration.
*
* Parameters:
*  None
*
* Return:
*  None
*
*******************************************************************************/
void TIMER_1_Init(void)
{

    /* Set values from customizer to CTRL */
    #if (TIMER_1__QUAD == TIMER_1_CONFIG)
        TIMER_1_CONTROL_REG = TIMER_1_CTRL_QUAD_BASE_CONFIG;
        
        /* Set values from customizer to CTRL1 */
        TIMER_1_TRIG_CONTROL1_REG  = TIMER_1_QUAD_SIGNALS_MODES;

        /* Set values from customizer to INTR */
        TIMER_1_SetInterruptMode(TIMER_1_QUAD_INTERRUPT_MASK);
        
         /* Set other values */
        TIMER_1_SetCounterMode(TIMER_1_COUNT_DOWN);
        TIMER_1_WritePeriod(TIMER_1_QUAD_PERIOD_INIT_VALUE);
        TIMER_1_WriteCounter(TIMER_1_QUAD_PERIOD_INIT_VALUE);
    #endif  /* (TIMER_1__QUAD == TIMER_1_CONFIG) */

    #if (TIMER_1__TIMER == TIMER_1_CONFIG)
        TIMER_1_CONTROL_REG = TIMER_1_CTRL_TIMER_BASE_CONFIG;
        
        /* Set values from customizer to CTRL1 */
        TIMER_1_TRIG_CONTROL1_REG  = TIMER_1_TIMER_SIGNALS_MODES;
    
        /* Set values from customizer to INTR */
        TIMER_1_SetInterruptMode(TIMER_1_TC_INTERRUPT_MASK);
        
        /* Set other values from customizer */
        TIMER_1_WritePeriod(TIMER_1_TC_PERIOD_VALUE );

        #if (TIMER_1__COMPARE == TIMER_1_TC_COMP_CAP_MODE)
            TIMER_1_WriteCompare(TIMER_1_TC_COMPARE_VALUE);

            #if (1u == TIMER_1_TC_COMPARE_SWAP)
                TIMER_1_SetCompareSwap(1u);
                TIMER_1_WriteCompareBuf(TIMER_1_TC_COMPARE_BUF_VALUE);
            #endif  /* (1u == TIMER_1_TC_COMPARE_SWAP) */
        #endif  /* (TIMER_1__COMPARE == TIMER_1_TC_COMP_CAP_MODE) */

        /* Initialize counter value */
        #if (TIMER_1_CY_TCPWM_V2 && TIMER_1_TIMER_UPDOWN_CNT_USED && !TIMER_1_CY_TCPWM_4000)
            TIMER_1_WriteCounter(1u);
        #elif(TIMER_1__COUNT_DOWN == TIMER_1_TC_COUNTER_MODE)
            TIMER_1_WriteCounter(TIMER_1_TC_PERIOD_VALUE);
        #else
            TIMER_1_WriteCounter(0u);
        #endif /* (TIMER_1_CY_TCPWM_V2 && TIMER_1_TIMER_UPDOWN_CNT_USED && !TIMER_1_CY_TCPWM_4000) */
    #endif  /* (TIMER_1__TIMER == TIMER_1_CONFIG) */

    #if (TIMER_1__PWM_SEL == TIMER_1_CONFIG)
        TIMER_1_CONTROL_REG = TIMER_1_CTRL_PWM_BASE_CONFIG;

        #if (TIMER_1__PWM_PR == TIMER_1_PWM_MODE)
            TIMER_1_CONTROL_REG |= TIMER_1_CTRL_PWM_RUN_MODE;
            TIMER_1_WriteCounter(TIMER_1_PWM_PR_INIT_VALUE);
        #else
            TIMER_1_CONTROL_REG |= TIMER_1_CTRL_PWM_ALIGN | TIMER_1_CTRL_PWM_KILL_EVENT;
            
            /* Initialize counter value */
            #if (TIMER_1_CY_TCPWM_V2 && TIMER_1_PWM_UPDOWN_CNT_USED && !TIMER_1_CY_TCPWM_4000)
                TIMER_1_WriteCounter(1u);
            #elif (TIMER_1__RIGHT == TIMER_1_PWM_ALIGN)
                TIMER_1_WriteCounter(TIMER_1_PWM_PERIOD_VALUE);
            #else 
                TIMER_1_WriteCounter(0u);
            #endif  /* (TIMER_1_CY_TCPWM_V2 && TIMER_1_PWM_UPDOWN_CNT_USED && !TIMER_1_CY_TCPWM_4000) */
        #endif  /* (TIMER_1__PWM_PR == TIMER_1_PWM_MODE) */

        #if (TIMER_1__PWM_DT == TIMER_1_PWM_MODE)
            TIMER_1_CONTROL_REG |= TIMER_1_CTRL_PWM_DEAD_TIME_CYCLE;
        #endif  /* (TIMER_1__PWM_DT == TIMER_1_PWM_MODE) */

        #if (TIMER_1__PWM == TIMER_1_PWM_MODE)
            TIMER_1_CONTROL_REG |= TIMER_1_CTRL_PWM_PRESCALER;
        #endif  /* (TIMER_1__PWM == TIMER_1_PWM_MODE) */

        /* Set values from customizer to CTRL1 */
        TIMER_1_TRIG_CONTROL1_REG  = TIMER_1_PWM_SIGNALS_MODES;
    
        /* Set values from customizer to INTR */
        TIMER_1_SetInterruptMode(TIMER_1_PWM_INTERRUPT_MASK);

        /* Set values from customizer to CTRL2 */
        #if (TIMER_1__PWM_PR == TIMER_1_PWM_MODE)
            TIMER_1_TRIG_CONTROL2_REG =
                    (TIMER_1_CC_MATCH_NO_CHANGE    |
                    TIMER_1_OVERLOW_NO_CHANGE      |
                    TIMER_1_UNDERFLOW_NO_CHANGE);
        #else
            #if (TIMER_1__LEFT == TIMER_1_PWM_ALIGN)
                TIMER_1_TRIG_CONTROL2_REG = TIMER_1_PWM_MODE_LEFT;
            #endif  /* ( TIMER_1_PWM_LEFT == TIMER_1_PWM_ALIGN) */

            #if (TIMER_1__RIGHT == TIMER_1_PWM_ALIGN)
                TIMER_1_TRIG_CONTROL2_REG = TIMER_1_PWM_MODE_RIGHT;
            #endif  /* ( TIMER_1_PWM_RIGHT == TIMER_1_PWM_ALIGN) */

            #if (TIMER_1__CENTER == TIMER_1_PWM_ALIGN)
                TIMER_1_TRIG_CONTROL2_REG = TIMER_1_PWM_MODE_CENTER;
            #endif  /* ( TIMER_1_PWM_CENTER == TIMER_1_PWM_ALIGN) */

            #if (TIMER_1__ASYMMETRIC == TIMER_1_PWM_ALIGN)
                TIMER_1_TRIG_CONTROL2_REG = TIMER_1_PWM_MODE_ASYM;
            #endif  /* (TIMER_1__ASYMMETRIC == TIMER_1_PWM_ALIGN) */
        #endif  /* (TIMER_1__PWM_PR == TIMER_1_PWM_MODE) */

        /* Set other values from customizer */
        TIMER_1_WritePeriod(TIMER_1_PWM_PERIOD_VALUE );
        TIMER_1_WriteCompare(TIMER_1_PWM_COMPARE_VALUE);

        #if (1u == TIMER_1_PWM_COMPARE_SWAP)
            TIMER_1_SetCompareSwap(1u);
            TIMER_1_WriteCompareBuf(TIMER_1_PWM_COMPARE_BUF_VALUE);
        #endif  /* (1u == TIMER_1_PWM_COMPARE_SWAP) */

