mazelb/Heddoko-Firmware/HeddokoBLE/HeddokoBLE.cydsn/Generated_Source/PSoC4/TIMER_1.c
        #if (1u == TIMER_1_PWM_PERIOD_SWAP)
            TIMER_1_SetPeriodSwap(1u);
            TIMER_1_WritePeriodBuf(TIMER_1_PWM_PERIOD_BUF_VALUE);
        #endif  /* (1u == TIMER_1_PWM_PERIOD_SWAP) */
    #endif  /* (TIMER_1__PWM_SEL == TIMER_1_CONFIG) */
    
}


/*******************************************************************************
* Function Name: TIMER_1_Enable
********************************************************************************
*
* Summary:
*  Enables the TIMER_1.
*
* Parameters:
*  None
*
* Return:
*  None
*
*******************************************************************************/
void TIMER_1_Enable(void)
{
    uint8 enableInterrupts;

    enableInterrupts = CyEnterCriticalSection();
    TIMER_1_BLOCK_CONTROL_REG |= TIMER_1_MASK;
    CyExitCriticalSection(enableInterrupts);

    /* Start Timer or PWM if start input is absent */
    #if (TIMER_1__PWM_SEL == TIMER_1_CONFIG)
        #if (0u == TIMER_1_PWM_START_SIGNAL_PRESENT)
            TIMER_1_TriggerCommand(TIMER_1_MASK, TIMER_1_CMD_START);
        #endif /* (0u == TIMER_1_PWM_START_SIGNAL_PRESENT) */
    #endif /* (TIMER_1__PWM_SEL == TIMER_1_CONFIG) */

    #if (TIMER_1__TIMER == TIMER_1_CONFIG)
        #if (0u == TIMER_1_TC_START_SIGNAL_PRESENT)
            TIMER_1_TriggerCommand(TIMER_1_MASK, TIMER_1_CMD_START);
        #endif /* (0u == TIMER_1_TC_START_SIGNAL_PRESENT) */
    #endif /* (TIMER_1__TIMER == TIMER_1_CONFIG) */
    
    #if (TIMER_1__QUAD == TIMER_1_CONFIG)
        #if (0u != TIMER_1_QUAD_AUTO_START)
            TIMER_1_TriggerCommand(TIMER_1_MASK, TIMER_1_CMD_RELOAD);
        #endif /* (0u != TIMER_1_QUAD_AUTO_START) */
    #endif  /* (TIMER_1__QUAD == TIMER_1_CONFIG) */
}


/*******************************************************************************
* Function Name: TIMER_1_Start
********************************************************************************
*
* Summary:
*  Initializes the TIMER_1 with default customizer
*  values when called the first time and enables the TIMER_1.
*  For subsequent calls the configuration is left unchanged and the component is
*  just enabled.
*
* Parameters:
*  None
*
* Return:
*  None
*
* Global variables:
*  TIMER_1_initVar: global variable is used to indicate initial
*  configuration of this component.  The variable is initialized to zero and set
*  to 1 the first time TIMER_1_Start() is called. This allows
*  enabling/disabling a component without re-initialization in all subsequent
*  calls to the TIMER_1_Start() routine.
*
*******************************************************************************/
void TIMER_1_Start(void)
{
    if (0u == TIMER_1_initVar)
    {
        TIMER_1_Init();
        TIMER_1_initVar = 1u;
    }

    TIMER_1_Enable();
}


/*******************************************************************************
* Function Name: TIMER_1_Stop
********************************************************************************
*
* Summary:
*  Disables the TIMER_1.
*
* Parameters:
*  None
*
* Return:
*  None
*
*******************************************************************************/
void TIMER_1_Stop(void)
{
    uint8 enableInterrupts;

    enableInterrupts = CyEnterCriticalSection();

    TIMER_1_BLOCK_CONTROL_REG &= (uint32)~TIMER_1_MASK;

    CyExitCriticalSection(enableInterrupts);
}


/*******************************************************************************
* Function Name: TIMER_1_SetMode
********************************************************************************
*
* Summary:
*  Sets the operation mode of the TIMER_1. This function is used when
*  configured as a generic TIMER_1 and the actual mode of operation is
*  set at runtime. The mode must be set while the component is disabled.
*
* Parameters:
*  mode: Mode for the TIMER_1 to operate in
*   Values:
*   - TIMER_1_MODE_TIMER_COMPARE - Timer / Counter with
*                                                 compare capability
*         - TIMER_1_MODE_TIMER_CAPTURE - Timer / Counter with
*                                                 capture capability
*         - TIMER_1_MODE_QUAD - Quadrature decoder
*         - TIMER_1_MODE_PWM - PWM
*         - TIMER_1_MODE_PWM_DT - PWM with dead time
*         - TIMER_1_MODE_PWM_PR - PWM with pseudo random capability
*
* Return:
*  None
*
*******************************************************************************/
void TIMER_1_SetMode(uint32 mode)
{
    uint8 enableInterrupts;

    enableInterrupts = CyEnterCriticalSection();

    TIMER_1_CONTROL_REG &= (uint32)~TIMER_1_MODE_MASK;
    TIMER_1_CONTROL_REG |= mode;

    CyExitCriticalSection(enableInterrupts);
}


/*******************************************************************************
* Function Name: TIMER_1_SetQDMode
********************************************************************************
*
* Summary:
*  Sets the the Quadrature Decoder to one of the 3 supported modes.
*  Its functionality is only applicable to Quadrature Decoder operation.
*
* Parameters:
*  qdMode: Quadrature Decoder mode
*   Values:
*         - TIMER_1_MODE_X1 - Counts on phi 1 rising
*         - TIMER_1_MODE_X2 - Counts on both edges of phi1 (2x faster)
*         - TIMER_1_MODE_X4 - Counts on both edges of phi1 and phi2
*                                        (4x faster)
*
* Return:
*  None
*
*******************************************************************************/
void TIMER_1_SetQDMode(uint32 qdMode)
{
    uint8 enableInterrupts;

    enableInterrupts = CyEnterCriticalSection();

    TIMER_1_CONTROL_REG &= (uint32)~TIMER_1_QUAD_MODE_MASK;
    TIMER_1_CONTROL_REG |= qdMode;

    CyExitCriticalSection(enableInterrupts);
}


/*******************************************************************************
* Function Name: TIMER_1_SetPrescaler
********************************************************************************
*
* Summary:
*  Sets the prescaler value that is applied to the clock input.  Not applicable
*  to a PWM with the dead time mode or Quadrature Decoder mode.
*
* Parameters:
*  prescaler: Prescaler divider value
*   Values:
*         - TIMER_1_PRESCALE_DIVBY1    - Divide by 1 (no prescaling)
*         - TIMER_1_PRESCALE_DIVBY2    - Divide by 2
*         - TIMER_1_PRESCALE_DIVBY4    - Divide by 4
*         - TIMER_1_PRESCALE_DIVBY8    - Divide by 8
*         - TIMER_1_PRESCALE_DIVBY16   - Divide by 16
*         - TIMER_1_PRESCALE_DIVBY32   - Divide by 32
*         - TIMER_1_PRESCALE_DIVBY64   - Divide by 64
*         - TIMER_1_PRESCALE_DIVBY128  - Divide by 128
*
* Return:
*  None
*
*******************************************************************************/
void TIMER_1_SetPrescaler(uint32 prescaler)
{
    uint8 enableInterrupts;

