mazelb/Heddoko-Firmware/HeddokoBLE/HeddokoBLE.cydsn/Generated_Source/PSoC4/TIMER_1.c
    enableInterrupts = CyEnterCriticalSection();

    TIMER_1_CONTROL_REG &= (uint32)~TIMER_1_PRESCALER_MASK;
    TIMER_1_CONTROL_REG |= ((uint32)((deadTime & TIMER_1_8BIT_MASK) <<
                                                          TIMER_1_PRESCALER_SHIFT));

    CyExitCriticalSection(enableInterrupts);
}


/*******************************************************************************
* Function Name: TIMER_1_SetPWMInvert
********************************************************************************
*
* Summary:
*  Writes the bits that control whether the line and line_n outputs are
*  inverted from their normal output values.  This functionality is only
*  applicable to the three PWM modes.
*
* Parameters:
*  mask: Mask of outputs to invert.
*   Values:
*         - TIMER_1_INVERT_LINE   - Inverts the line output
*         - TIMER_1_INVERT_LINE_N - Inverts the line_n output
*
* Return:
*  None
*
*******************************************************************************/
void TIMER_1_SetPWMInvert(uint32 mask)
{
    uint8 enableInterrupts;

    enableInterrupts = CyEnterCriticalSection();

    TIMER_1_CONTROL_REG &= (uint32)~TIMER_1_INV_OUT_MASK;
    TIMER_1_CONTROL_REG |= mask;

    CyExitCriticalSection(enableInterrupts);
}



/*******************************************************************************
* Function Name: TIMER_1_WriteCounter
********************************************************************************
*
* Summary:
*  Writes a new 16bit counter value directly into the counter register, thus
*  setting the counter (not the period) to the value written. It is not
*  advised to write to this field when the counter is running.
*
* Parameters:
*  count: value to write
*
* Return:
*  None
*
*******************************************************************************/
void TIMER_1_WriteCounter(uint32 count)
{
    TIMER_1_COUNTER_REG = (count & TIMER_1_16BIT_MASK);
}


/*******************************************************************************
* Function Name: TIMER_1_ReadCounter
********************************************************************************
*
* Summary:
*  Reads the current counter value.
*
* Parameters:
*  None
*
* Return:
*  Current counter value
*
*******************************************************************************/
uint32 TIMER_1_ReadCounter(void)
{
    return (TIMER_1_COUNTER_REG & TIMER_1_16BIT_MASK);
}


/*******************************************************************************
* Function Name: TIMER_1_SetCounterMode
********************************************************************************
*
* Summary:
*  Sets the counter mode.  Applicable to all modes except Quadrature Decoder
*  and the PWM with a pseudo random output.
*
* Parameters:
*  counterMode: Enumerated counter type values
*   Values:
*     - TIMER_1_COUNT_UP       - Counts up
*     - TIMER_1_COUNT_DOWN     - Counts down
*     - TIMER_1_COUNT_UPDOWN0  - Counts up and down. Terminal count
*                                         generated when counter reaches 0
*     - TIMER_1_COUNT_UPDOWN1  - Counts up and down. Terminal count
*                                         generated both when counter reaches 0
*                                         and period
*
* Return:
*  None
*
*******************************************************************************/
void TIMER_1_SetCounterMode(uint32 counterMode)
{
    uint8 enableInterrupts;

    enableInterrupts = CyEnterCriticalSection();

    TIMER_1_CONTROL_REG &= (uint32)~TIMER_1_UPDOWN_MASK;
    TIMER_1_CONTROL_REG |= counterMode;

    CyExitCriticalSection(enableInterrupts);
}


/*******************************************************************************
* Function Name: TIMER_1_WritePeriod
********************************************************************************
*
* Summary:
*  Writes the 16 bit period register with the new period value.
*  To cause the counter to count for N cycles this register should be written
*  with N-1 (counts from 0 to period inclusive).
*
* Parameters:
*  period: Period value
*
* Return:
*  None
*
*******************************************************************************/
void TIMER_1_WritePeriod(uint32 period)
{
    TIMER_1_PERIOD_REG = (period & TIMER_1_16BIT_MASK);
}


/*******************************************************************************
* Function Name: TIMER_1_ReadPeriod
********************************************************************************
*
* Summary:
*  Reads the 16 bit period register.
*
* Parameters:
*  None
*
* Return:
*  Period value
*
*******************************************************************************/
uint32 TIMER_1_ReadPeriod(void)
{
    return (TIMER_1_PERIOD_REG & TIMER_1_16BIT_MASK);
}


/*******************************************************************************
* Function Name: TIMER_1_SetCompareSwap
********************************************************************************
*
* Summary:
*  Writes the register that controls whether the compare registers are
*  swapped. When enabled in the Timer/Counter mode(without capture) the swap
*  occurs at a TC event. In the PWM mode the swap occurs at the next TC event
*  following a hardware switch event.
*
* Parameters:
*  swapEnable
*   Values:
*     - 0 - Disable swap
*     - 1 - Enable swap
*
* Return:
*  None
*
*******************************************************************************/
void TIMER_1_SetCompareSwap(uint32 swapEnable)
{
    uint8 enableInterrupts;

    enableInterrupts = CyEnterCriticalSection();

    TIMER_1_CONTROL_REG &= (uint32)~TIMER_1_RELOAD_CC_MASK;
    TIMER_1_CONTROL_REG |= (swapEnable & TIMER_1_1BIT_MASK);

    CyExitCriticalSection(enableInterrupts);
}


/*******************************************************************************
* Function Name: TIMER_1_WritePeriodBuf
********************************************************************************
*
* Summary:
*  Writes the 16 bit period buf register with the new period value.
*
* Parameters:
*  periodBuf: Period value
*
* Return:
*  None
*
*******************************************************************************/
void TIMER_1_WritePeriodBuf(uint32 periodBuf)
{
    TIMER_1_PERIOD_BUF_REG = (periodBuf & TIMER_1_16BIT_MASK);
}


