mazelb/Heddoko-Firmware/HeddokoBLE/HeddokoBLE.cydsn/Generated_Source/PSoC4/TIMER_1.c
/*******************************************************************************
* Function Name: TIMER_1_ReadPeriodBuf
********************************************************************************
*
* Summary:
*  Reads the 16 bit period buf register.
*
* Parameters:
*  None
*
* Return:
*  Period value
*
*******************************************************************************/
uint32 TIMER_1_ReadPeriodBuf(void)
{
    return (TIMER_1_PERIOD_BUF_REG & TIMER_1_16BIT_MASK);
}


/*******************************************************************************
* Function Name: TIMER_1_SetPeriodSwap
********************************************************************************
*
* Summary:
*  Writes the register that controls whether the period registers are
*  swapped. When enabled in Timer/Counter mode the swap occurs at a TC event.
*  In the PWM mode the swap occurs at the next TC event following a hardware
*  switch event.
*
* Parameters:
*  swapEnable
*   Values:
*     - 0 - Disable swap
*     - 1 - Enable swap
*
* Return:
*  None
*
*******************************************************************************/
void TIMER_1_SetPeriodSwap(uint32 swapEnable)
{
    uint8 enableInterrupts;

    enableInterrupts = CyEnterCriticalSection();

    TIMER_1_CONTROL_REG &= (uint32)~TIMER_1_RELOAD_PERIOD_MASK;
    TIMER_1_CONTROL_REG |= ((uint32)((swapEnable & TIMER_1_1BIT_MASK) <<
                                                            TIMER_1_RELOAD_PERIOD_SHIFT));

    CyExitCriticalSection(enableInterrupts);
}


/*******************************************************************************
* Function Name: TIMER_1_WriteCompare
********************************************************************************
*
* Summary:
*  Writes the 16 bit compare register with the new compare value. Not
*  applicable for Timer/Counter with Capture or in Quadrature Decoder modes.
*
* Parameters:
*  compare: Compare value
*
* Return:
*  None
*
* Note:
*  It is not recommended to use the value equal to "0" or equal to 
*  "period value" in Center or Asymmetric align PWM modes on the 
*  PSoC 4100/PSoC 4200 devices.
*  PSoC 4000 devices write the 16 bit compare register with the decremented 
*  compare value in the Up counting mode (except 0x0u), and the incremented 
*  compare value in the Down counting mode (except 0xFFFFu).
*
*******************************************************************************/
void TIMER_1_WriteCompare(uint32 compare)
{
    #if (TIMER_1_CY_TCPWM_4000)
        uint32 currentMode;
    #endif /* (TIMER_1_CY_TCPWM_4000) */

    #if (TIMER_1_CY_TCPWM_4000)
        currentMode = ((TIMER_1_CONTROL_REG & TIMER_1_UPDOWN_MASK) >> TIMER_1_UPDOWN_SHIFT);

        if (((uint32)TIMER_1__COUNT_DOWN == currentMode) && (0xFFFFu != compare))
        {
            compare++;
        }
        else if (((uint32)TIMER_1__COUNT_UP == currentMode) && (0u != compare))
        {
            compare--;
        }
        else
        {
        }
        
    
    #endif /* (TIMER_1_CY_TCPWM_4000) */
    
    TIMER_1_COMP_CAP_REG = (compare & TIMER_1_16BIT_MASK);
}


/*******************************************************************************
* Function Name: TIMER_1_ReadCompare
********************************************************************************
*
* Summary:
*  Reads the compare register. Not applicable for Timer/Counter with Capture
*  or in Quadrature Decoder modes.
*  PSoC 4000 devices read the incremented compare register value in the 
*  Up counting mode (except 0xFFFFu), and the decremented value in the 
*  Down counting mode (except 0x0u).
*
* Parameters:
*  None
*
* Return:
*  Compare value
*
* Note:
*  PSoC 4000 devices read the incremented compare register value in the 
*  Up counting mode (except 0xFFFFu), and the decremented value in the 
*  Down counting mode (except 0x0u).
*
*******************************************************************************/
uint32 TIMER_1_ReadCompare(void)
{
    #if (TIMER_1_CY_TCPWM_4000)
        uint32 currentMode;
        uint32 regVal;
    #endif /* (TIMER_1_CY_TCPWM_4000) */

    #if (TIMER_1_CY_TCPWM_4000)
        currentMode = ((TIMER_1_CONTROL_REG & TIMER_1_UPDOWN_MASK) >> TIMER_1_UPDOWN_SHIFT);
        
        regVal = TIMER_1_COMP_CAP_REG;
        
        if (((uint32)TIMER_1__COUNT_DOWN == currentMode) && (0u != regVal))
        {
            regVal--;
        }
        else if (((uint32)TIMER_1__COUNT_UP == currentMode) && (0xFFFFu != regVal))
        {
            regVal++;
        }
        else
        {
        }

        return (regVal & TIMER_1_16BIT_MASK);
    #else
        return (TIMER_1_COMP_CAP_REG & TIMER_1_16BIT_MASK);
    #endif /* (TIMER_1_CY_TCPWM_4000) */
}


/*******************************************************************************
* Function Name: TIMER_1_WriteCompareBuf
********************************************************************************
*
* Summary:
*  Writes the 16 bit compare buffer register with the new compare value. Not
*  applicable for Timer/Counter with Capture or in Quadrature Decoder modes.
*
* Parameters:
*  compareBuf: Compare value
*
* Return:
*  None
*
* Note:
*  It is not recommended to use the value equal to "0" or equal to 
*  "period value" in Center or Asymmetric align PWM modes on the 
*  PSoC 4100/PSoC 4200 devices.
*  PSoC 4000 devices write the 16 bit compare register with the decremented 
*  compare value in the Up counting mode (except 0x0u), and the incremented 
*  compare value in the Down counting mode (except 0xFFFFu).
*
*******************************************************************************/
void TIMER_1_WriteCompareBuf(uint32 compareBuf)
{
    #if (TIMER_1_CY_TCPWM_4000)
        uint32 currentMode;
    #endif /* (TIMER_1_CY_TCPWM_4000) */

    #if (TIMER_1_CY_TCPWM_4000)
        currentMode = ((TIMER_1_CONTROL_REG & TIMER_1_UPDOWN_MASK) >> TIMER_1_UPDOWN_SHIFT);

        if (((uint32)TIMER_1__COUNT_DOWN == currentMode) && (0xFFFFu != compareBuf))
        {
            compareBuf++;
        }
        else if (((uint32)TIMER_1__COUNT_UP == currentMode) && (0u != compareBuf))
        {
            compareBuf --;
        }
        else
        {
        }
    #endif /* (TIMER_1_CY_TCPWM_4000) */
    
    TIMER_1_COMP_CAP_BUF_REG = (compareBuf & TIMER_1_16BIT_MASK);
}


