mazelb/Heddoko-Firmware/HeddokoBLE/HeddokoBLE.cydsn/Generated_Source/PSoC4/TIMER_1.c
/*******************************************************************************
* Function Name: TIMER_1_ReadCompareBuf
********************************************************************************
*
* Summary:
*  Reads the compare buffer register. Not applicable for Timer/Counter with
*  Capture or in Quadrature Decoder modes.
*
* Parameters:
*  None
*
* Return:
*  Compare buffer value
*
* Note:
*  PSoC 4000 devices read the incremented compare register value in the 
*  Up counting mode (except 0xFFFFu), and the decremented value in the 
*  Down counting mode (except 0x0u).
*
*******************************************************************************/
uint32 TIMER_1_ReadCompareBuf(void)
{
    #if (TIMER_1_CY_TCPWM_4000)
        uint32 currentMode;
        uint32 regVal;
    #endif /* (TIMER_1_CY_TCPWM_4000) */

    #if (TIMER_1_CY_TCPWM_4000)
        currentMode = ((TIMER_1_CONTROL_REG & TIMER_1_UPDOWN_MASK) >> TIMER_1_UPDOWN_SHIFT);

        regVal = TIMER_1_COMP_CAP_BUF_REG;
        
        if (((uint32)TIMER_1__COUNT_DOWN == currentMode) && (0u != regVal))
        {
            regVal--;
        }
        else if (((uint32)TIMER_1__COUNT_UP == currentMode) && (0xFFFFu != regVal))
        {
            regVal++;
        }
        else
        {
        }

        return (regVal & TIMER_1_16BIT_MASK);
    #else
        return (TIMER_1_COMP_CAP_BUF_REG & TIMER_1_16BIT_MASK);
    #endif /* (TIMER_1_CY_TCPWM_4000) */
}


/*******************************************************************************
* Function Name: TIMER_1_ReadCapture
********************************************************************************
*
* Summary:
*  Reads the captured counter value. This API is applicable only for
*  Timer/Counter with the capture mode and Quadrature Decoder modes.
*
* Parameters:
*  None
*
* Return:
*  Capture value
*
*******************************************************************************/
uint32 TIMER_1_ReadCapture(void)
{
    return (TIMER_1_COMP_CAP_REG & TIMER_1_16BIT_MASK);
}


/*******************************************************************************
* Function Name: TIMER_1_ReadCaptureBuf
********************************************************************************
*
* Summary:
*  Reads the capture buffer register. This API is applicable only for
*  Timer/Counter with the capture mode and Quadrature Decoder modes.
*
* Parameters:
*  None
*
* Return:
*  Capture buffer value
*
*******************************************************************************/
uint32 TIMER_1_ReadCaptureBuf(void)
{
    return (TIMER_1_COMP_CAP_BUF_REG & TIMER_1_16BIT_MASK);
}


/*******************************************************************************
* Function Name: TIMER_1_SetCaptureMode
********************************************************************************
*
* Summary:
*  Sets the capture trigger mode. For PWM mode this is the switch input.
*  This input is not applicable to the Timer/Counter without Capture and
*  Quadrature Decoder modes.
*
* Parameters:
*  triggerMode: Enumerated trigger mode value
*   Values:
*     - TIMER_1_TRIG_LEVEL     - Level
*     - TIMER_1_TRIG_RISING    - Rising edge
*     - TIMER_1_TRIG_FALLING   - Falling edge
*     - TIMER_1_TRIG_BOTH      - Both rising and falling edge
*
* Return:
*  None
*
*******************************************************************************/
void TIMER_1_SetCaptureMode(uint32 triggerMode)
{
    uint8 enableInterrupts;

    enableInterrupts = CyEnterCriticalSection();

    TIMER_1_TRIG_CONTROL1_REG &= (uint32)~TIMER_1_CAPTURE_MASK;
    TIMER_1_TRIG_CONTROL1_REG |= triggerMode;

    CyExitCriticalSection(enableInterrupts);
}


/*******************************************************************************
* Function Name: TIMER_1_SetReloadMode
********************************************************************************
*
* Summary:
*  Sets the reload trigger mode. For Quadrature Decoder mode this is the index
*  input.
*
* Parameters:
*  triggerMode: Enumerated trigger mode value
*   Values:
*     - TIMER_1_TRIG_LEVEL     - Level
*     - TIMER_1_TRIG_RISING    - Rising edge
*     - TIMER_1_TRIG_FALLING   - Falling edge
*     - TIMER_1_TRIG_BOTH      - Both rising and falling edge
*
* Return:
*  None
*
*******************************************************************************/
void TIMER_1_SetReloadMode(uint32 triggerMode)
{
    uint8 enableInterrupts;

    enableInterrupts = CyEnterCriticalSection();

    TIMER_1_TRIG_CONTROL1_REG &= (uint32)~TIMER_1_RELOAD_MASK;
    TIMER_1_TRIG_CONTROL1_REG |= ((uint32)(triggerMode << TIMER_1_RELOAD_SHIFT));

    CyExitCriticalSection(enableInterrupts);
}


/*******************************************************************************
* Function Name: TIMER_1_SetStartMode
********************************************************************************
*
* Summary:
*  Sets the start trigger mode. For Quadrature Decoder mode this is the
*  phiB input.
*
* Parameters:
*  triggerMode: Enumerated trigger mode value
*   Values:
*     - TIMER_1_TRIG_LEVEL     - Level
*     - TIMER_1_TRIG_RISING    - Rising edge
*     - TIMER_1_TRIG_FALLING   - Falling edge
*     - TIMER_1_TRIG_BOTH      - Both rising and falling edge
*
* Return:
*  None
*
*******************************************************************************/
void TIMER_1_SetStartMode(uint32 triggerMode)
{
    uint8 enableInterrupts;

    enableInterrupts = CyEnterCriticalSection();

    TIMER_1_TRIG_CONTROL1_REG &= (uint32)~TIMER_1_START_MASK;
    TIMER_1_TRIG_CONTROL1_REG |= ((uint32)(triggerMode << TIMER_1_START_SHIFT));

    CyExitCriticalSection(enableInterrupts);
}


/*******************************************************************************
* Function Name: TIMER_1_SetStopMode
********************************************************************************
*
* Summary:
*  Sets the stop trigger mode. For PWM mode this is the kill input.
*
* Parameters:
*  triggerMode: Enumerated trigger mode value
*   Values:
*     - TIMER_1_TRIG_LEVEL     - Level
*     - TIMER_1_TRIG_RISING    - Rising edge
*     - TIMER_1_TRIG_FALLING   - Falling edge
*     - TIMER_1_TRIG_BOTH      - Both rising and falling edge
*
* Return:
*  None
*
*******************************************************************************/
void TIMER_1_SetStopMode(uint32 triggerMode)
{
    uint8 enableInterrupts;

