mazelb/Heddoko-Firmware/HeddokoBLE/HeddokoBLE.cydsn/Generated_Source/PSoC4/TIMER_1.c
    enableInterrupts = CyEnterCriticalSection();

    TIMER_1_TRIG_CONTROL1_REG &= (uint32)~TIMER_1_STOP_MASK;
    TIMER_1_TRIG_CONTROL1_REG |= ((uint32)(triggerMode << TIMER_1_STOP_SHIFT));

    CyExitCriticalSection(enableInterrupts);
}


/*******************************************************************************
* Function Name: TIMER_1_SetCountMode
********************************************************************************
*
* Summary:
*  Sets the count trigger mode. For Quadrature Decoder mode this is the phiA
*  input.
*
* Parameters:
*  triggerMode: Enumerated trigger mode value
*   Values:
*     - TIMER_1_TRIG_LEVEL     - Level
*     - TIMER_1_TRIG_RISING    - Rising edge
*     - TIMER_1_TRIG_FALLING   - Falling edge
*     - TIMER_1_TRIG_BOTH      - Both rising and falling edge
*
* Return:
*  None
*
*******************************************************************************/
void TIMER_1_SetCountMode(uint32 triggerMode)
{
    uint8 enableInterrupts;

    enableInterrupts = CyEnterCriticalSection();

    TIMER_1_TRIG_CONTROL1_REG &= (uint32)~TIMER_1_COUNT_MASK;
    TIMER_1_TRIG_CONTROL1_REG |= ((uint32)(triggerMode << TIMER_1_COUNT_SHIFT));

    CyExitCriticalSection(enableInterrupts);
}


/*******************************************************************************
* Function Name: TIMER_1_TriggerCommand
********************************************************************************
*
* Summary:
*  Triggers the designated command to occur on the designated TCPWM instances.
*  The mask can be used to apply this command simultaneously to more than one
*  instance.  This allows multiple TCPWM instances to be synchronized.
*
* Parameters:
*  mask: A combination of mask bits for each instance of the TCPWM that the
*        command should apply to.  This function from one instance can be used
*        to apply the command to any of the instances in the design.
*        The mask value for a specific instance is available with the MASK
*        define.
*  command: Enumerated command values. Capture command only applicable for
*           Timer/Counter with Capture and PWM modes.
*   Values:
*     - TIMER_1_CMD_CAPTURE    - Trigger Capture/Switch command
*     - TIMER_1_CMD_RELOAD     - Trigger Reload/Index command
*     - TIMER_1_CMD_STOP       - Trigger Stop/Kill command
*     - TIMER_1_CMD_START      - Trigger Start/phiB command
*
* Return:
*  None
*
*******************************************************************************/
void TIMER_1_TriggerCommand(uint32 mask, uint32 command)
{
    uint8 enableInterrupts;

    enableInterrupts = CyEnterCriticalSection();

    TIMER_1_COMMAND_REG = ((uint32)(mask << command));

    CyExitCriticalSection(enableInterrupts);
}


/*******************************************************************************
* Function Name: TIMER_1_ReadStatus
********************************************************************************
*
* Summary:
*  Reads the status of the TIMER_1.
*
* Parameters:
*  None
*
* Return:
*  Status
*   Values:
*     - TIMER_1_STATUS_DOWN    - Set if counting down
*     - TIMER_1_STATUS_RUNNING - Set if counter is running
*
*******************************************************************************/
uint32 TIMER_1_ReadStatus(void)
{
    return ((TIMER_1_STATUS_REG >> TIMER_1_RUNNING_STATUS_SHIFT) |
            (TIMER_1_STATUS_REG & TIMER_1_STATUS_DOWN));
}


/*******************************************************************************
* Function Name: TIMER_1_SetInterruptMode
********************************************************************************
*
* Summary:
*  Sets the interrupt mask to control which interrupt
*  requests generate the interrupt signal.
*
* Parameters:
*   interruptMask: Mask of bits to be enabled
*   Values:
*     - TIMER_1_INTR_MASK_TC       - Terminal count mask
*     - TIMER_1_INTR_MASK_CC_MATCH - Compare count / capture mask
*
* Return:
*  None
*
*******************************************************************************/
void TIMER_1_SetInterruptMode(uint32 interruptMask)
{
    TIMER_1_INTERRUPT_MASK_REG =  interruptMask;
}


/*******************************************************************************
* Function Name: TIMER_1_GetInterruptSourceMasked
********************************************************************************
*
* Summary:
*  Gets the interrupt requests masked by the interrupt mask.
*
* Parameters:
*   None
*
* Return:
*  Masked interrupt source
*   Values:
*     - TIMER_1_INTR_MASK_TC       - Terminal count mask
*     - TIMER_1_INTR_MASK_CC_MATCH - Compare count / capture mask
*
*******************************************************************************/
uint32 TIMER_1_GetInterruptSourceMasked(void)
{
    return (TIMER_1_INTERRUPT_MASKED_REG);
}


/*******************************************************************************
* Function Name: TIMER_1_GetInterruptSource
********************************************************************************
*
* Summary:
*  Gets the interrupt requests (without masking).
*
* Parameters:
*  None
*
* Return:
*  Interrupt request value
*   Values:
*     - TIMER_1_INTR_MASK_TC       - Terminal count mask
*     - TIMER_1_INTR_MASK_CC_MATCH - Compare count / capture mask
*
*******************************************************************************/
uint32 TIMER_1_GetInterruptSource(void)
{
    return (TIMER_1_INTERRUPT_REQ_REG);
}


/*******************************************************************************
* Function Name: TIMER_1_ClearInterrupt
********************************************************************************
*
* Summary:
*  Clears the interrupt request.
*
* Parameters:
*   interruptMask: Mask of interrupts to clear
*   Values:
*     - TIMER_1_INTR_MASK_TC       - Terminal count mask
*     - TIMER_1_INTR_MASK_CC_MATCH - Compare count / capture mask
*
* Return:
*  None
*
*******************************************************************************/
void TIMER_1_ClearInterrupt(uint32 interruptMask)
{
    TIMER_1_INTERRUPT_REQ_REG = interruptMask;
}


/*******************************************************************************
* Function Name: TIMER_1_SetInterrupt
********************************************************************************
*
* Summary:
*  Sets a software interrupt request.
*
* Parameters:
*   interruptMask: Mask of interrupts to set
*   Values:
*     - TIMER_1_INTR_MASK_TC       - Terminal count mask
*     - TIMER_1_INTR_MASK_CC_MATCH - Compare count / capture mask
*
* Return:
*  None
*
*******************************************************************************/
void TIMER_1_SetInterrupt(uint32 interruptMask)
{
    TIMER_1_INTERRUPT_SET_REG = interruptMask;
}


/* [] END OF FILE */
